blog/app/controllers/articles_controller.rb

  def create
      @article = Article.new(article_params)

      if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)